Конфигурация отчетов/Documents/СменаСтатуса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СменаСтатуса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗадач_1</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/СменаСтатусаЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СменаСтатусаЗадачи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗадач</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРодитель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФункциональныйТипПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/СменаСтатуса/Ext/ManagerModule.bsl
Процедура СменаСтатуса(Заказ, ПланРодитель, ТекПлан, НовыйСтатус,ТипЗадачи) Экспорт
	ДокСменыСтатуса = Документы.СменаСтатусаЗадачи.СоздатьДокумент();
	ДокСменыСтатуса.Дата = ТекущаяДата();
	ДокСменыСтатуса.ЗаказКлиента = Заказ;
	ДокСменыСтатуса.ПланРодитель = ПланРодитель;
	ДокСменыСтатуса.ТекущийПлан = ТекПлан;
	ДокСменыСтатуса.НовыйСтатус = НовыйСтатус;
	ДокСменыСтатуса.ТипЗадачи = ТипЗадачи;
	ДокСменыСтатуса.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
